# Introduction to Pandas Lab

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [3]:
import pandas as pd
import numpy as np

### 2. Create a Pandas Series containing the elements of the list below.

In [4]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [5]:
a = pd.Series(lst)
a

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

### 3. Use indexing to return the third value in the Series above.

*Hint: Remember that indexing begins at 0.*

In [6]:
a.values[2]

74.4

### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [7]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [8]:
df = pd.DataFrame(b)
df

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

### 5. Rename the data frame columns based on the names in the list below.

In [9]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

In [10]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']

In [11]:
df = pd.DataFrame(b, columns=colnames)
print(list(df.columns))

['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score_5']

### 6. Create a subset of this data frame that contains only the Score 1, 3, and 5 columns.

In [12]:
subset_df = df[["Score_1", "Score_3", "Score_5"]]

### 7. From the original data frame, calculate the average Score_3 value.

In [13]:
df["Score_3"].mean()

56.95000000000001

### 8. From the original data frame, calculate the maximum Score_4 value.

In [14]:
df["Score_4"].max()

88.8

### 9. From the original data frame, calculate the median Score 2 value.

In [15]:
df["Score_2"].median()

40.75

### 10. Create a Pandas DataFrame from the dictionary of product orders below.

In [16]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [17]:
df = pd.DataFrame(orders)
df

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          1       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS      2880       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1      11.95    11.95
7                       PARTY BUNTING         4       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK        10       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS        48       1.25    60.00

### 11. Calculate the total quantity ordered and revenue generated from these orders.

In [18]:
total_qtd = df["Quantity"].sum()
total_qtd

2978

In [19]:
total_revenue = df["Revenue"].sum()
total_revenue

637.0

### 12. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [20]:
dif = df["UnitPrice"].max() - df["UnitPrice"].min()
dif

11.77

## Let's load another dataset for more exercisesº

In [38]:
# Run this code:
admissions = pd.read_csv('../Admission_Predict.csv')
#to remove trailing spaces at the end of the column names
admissions.columns = admissions.columns.str.rstrip()

Let's evaluate the dataset by looking at the `head` function.

In [39]:
admissions.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,1,337,118,4,4.5,4.5,9.65,1,0.92
1,2,316,104,3,3.0,3.5,8.00,1,0.72
2,3,322,110,3,3.5,2.5,8.67,1,0.80
3,4,314,103,2,2.0,3.0,8.21,0,0.65
4,5,330,115,5,4.5,3.0,9.34,1,0.90

### 1 - Before beginning to work with this dataset and evaluating graduate admissions data, we will verify that there is no missing data in the dataset. Do this in the cell below.

In [40]:
admissions.isna().sum()

Serial No.           0
GRE Score            0
TOEFL Score          0
University Rating    0
SOP                  0
LOR                  0
CGPA                 0
Research             0
Chance of Admit      0
dtype: int64

###  2 -  Interestingly, there is a column that uniquely identifies the applicants. This column is the serial number column. Instead of having our own index, we should make this column our index. Do this in the cell below. Keep the column in the dataframe in addition to making it an index.

In [42]:
admissions = admissions.set_index("Serial No.", drop=False)

In [43]:
admissions.sample()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,,
135,135,332,118,2,4.5,3.5,9.36,1,0.9

Turns out that `GRE Score` and `CGPA` also uniquely identify the data. Show this in the cell below.

In [53]:
admissions["CGPA"].is_unique

False

In [52]:
admissions["GRE Score"].is_unique

False

In [54]:
admissions["CGPA"].value_counts()

8.00    9
8.76    6
8.56    6
8.64    6
8.65    5
       ..
9.32    1
9.48    1
9.56    1
7.28    1
7.96    1
Name: CGPA, Length: 168, dtype: int64

In [46]:
admissions["GRE Score"].value_counts()

324    16
312    16
322    14
314    14
321    13
320    12
327    12
316    12
317    12
313    11
308    11
325    11
311    11
323    10
326    10
315    10
300     9
329     9
318     9
319     9
304     8
299     8
331     8
301     8
310     8
307     8
305     7
340     7
334     7
298     7
332     6
306     6
328     6
330     6
296     5
336     5
303     5
302     5
309     5
335     4
338     4
297     4
295     4
333     4
339     3
294     2
290     2
337     1
293     1
Name: GRE Score, dtype: int64

### 3 - In this part of the lab, we would like to test complex conditions on the entire data set at once. Let's start by finding the number of rows where the CGPA is greater than 9 and the student has performed an investigation.

In [55]:
condition_1 = admissions["CGPA"] > 9
condition_2 = admissions["Research"] == True

In [57]:
admissions[condition_1 & condition_2].sample(5)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,,
122,122,323,113,3,4.0,3.0,9.32,1,0.85
269,269,317,110,3,4.0,4.5,9.11,1,0.80
226,226,329,114,5,4.5,5.0,9.19,1,0.86
69,69,321,111,5,5.0,5.0,9.45,1,0.93
20,20,328,116,5,5.0,5.0,9.50,1,0.94

#### 4 - Now return all the rows where the CGPA is greater than 9 and the SOP score is less than 3.5. Find the mean chance of admit for these applicants.

In [59]:
condition_3 = admissions["GRE Score"] > 9
condition_4 = admissions["SOP"] < 3.5

In [61]:
filtered = admissions[condition_3 & condition_4]
filtered.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
Serial No.,,,,,,,,,
2,2,316,104,3,3.0,3.5,8.00,1,0.72
4,4,314,103,2,2.0,3.0,8.21,0,0.65
6,6,321,109,3,3.0,4.0,8.20,1,0.75
7,7,308,101,2,3.0,4.0,7.90,0,0.68
8,8,302,102,1,2.0,1.5,8.00,0,0.50

In [63]:
filtered["Chance of Admit"].mean()

0.6340718562874252

Let's create a new column based on the TOEFL Score column, where we put True if the TOEFL value is greater than 100 and False if it is less. We are going to do it with a function and an apply. 
To do this, we first create a function that receives an argument. The function will return True if the parameter entered is greater than 100, otherwise it will return False.

In [68]:
toefl_score = list(admissions["TOEFL Score"])
toefl_score

[118,
 104,
 110,
 103,
 115,
 109,
 101,
 102,
 108,
 111,
 112,
 109,
 104,
 105,
 107,
 106,
 110,
 102,
 114,
 116,
 119,
 119,
 109,
 98,
 93,
 99,
 97,
 103,
 118,
 114,
 112,
 110,
 106,
 105,
 105,
 108,
 110,
 105,
 107,
 117,
 113,
 110,
 114,
 119,
 110,
 111,
 98,
 100,
 116,
 112,
 110,
 103,
 102,
 99,
 99,
 104,
 100,
 101,
 105,
 107,
 111,
 112,
 114,
 107,
 109,
 115,
 118,
 112,
 111,
 108,
 106,
 114,
 112,
 99,
 95,
 93,
 105,
 120,
 110,
 115,
 115,
 103,
 106,
 107,
 108,
 106,
 97,
 98,
 97,
 99,
 100,
 100,
 120,
 119,
 113,
 107,
 105,
 106,
 104,
 112,
 110,
 111,
 117,
 116,
 103,
 108,
 109,
 107,
 110,
 105,
 106,
 102,
 104,
 99,
 104,
 117,
 119,
 106,
 108,
 106,
 100,
 113,
 112,
 112,
 118,
 114,
 105,
 112,
 113,
 109,
 100,
 116,
 109,
 110,
 118,
 115,
 120,
 112,
 113,
 105,
 114,
 116,
 106,
 114,
 116,
 112,
 105,
 108,
 109,
 105,
 104,
 106,
 100,
 103,
 99,
 109,
 105,
 111,
 110,
 102,
 102,
 97,
 99,
 101,
 117,
 110,
 113,
 111,
 111,
 119,
 110,
 108,
 102,
 104,
 107,
 100,
 110,
 113,
 107,
 118,
 115,
 111,
 110,
 114,
 118,
 109,
 107,
 105,
 106,
 107,
 103,
 110,
 120,
 120,
 105,
 99,
 99,
 102,
 106,
 104,
 108,
 110,
 120,
 119,
 117,
 116,
 112,
 109,
 110,
 104,
 103,
 110,
 109,
 105,
 99,
 110,
 112,
 111,
 104,
 106,
 107,
 100,
 113,
 111,
 112,
 114,
 104,
 100,
 101,
 103,
 115,
 114,
 107,
 110,
 105,
 104,
 110,
 111,
 104,
 99,
 100,
 115,
 114,
 110,
 99,
 100,
 119,
 108,
 104,
 103,
 111,
 110,
 102,
 105,
 107,
 113,
 108,
 105,
 96,
 95,
 99,
 100,
 110,
 113,
 101,
 103,
 102,
 102,
 110,
 106,
 111,
 112,
 116,
 118,
 114,
 104,
 109,
 105,
 102,
 99,
 98,
 101,
 100,
 107,
 120,
 114,
 112,
 106,
 108,
 105,
 107,
 106,
 109,
 110,
 112,
 108,
 110,
 104,
 108,
 107,
 100,
 104,
 101,
 99,
 111,
 113,
 106,
 104,
 107,
 102,
 104,
 116,
 100,
 101,
 112,
 96,
 113,
 105,
 106,
 108,
 107,
 110,
 118,
 108,
 107,
 107,
 110,
 106,
 103,
 96,
 98,
 97,
 94,
 99,
 101,
 107,
 110,
 100,
 102,
 98,
 106,
 109,
 104,
 105,
 107,
 110,
 116,
 115,
 103,
 102,
 114,
 104,
 98,
 92,
 98,
 103,
 110,
 119,
 109,
 105,
 101,
 96,
 100,
 98,
 99,
 104,
 105,
 110,
 100,
 113,
 117,
 101,
 105,
 97,
 108,
 102,
 106,
 112,
 104,
 111,
 110,
 107,
 116,
 103,
 117]

In [70]:
def toefl(score):
    if score > 100:
        return True
    else:
        return False

Now we create a new column called "Decision" and apply to the TOEFL Score column

In [75]:
admissions["Decision"] = admissions["TOEFL Score"].apply(toefl)

admissions.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit,Toefl-100,Decision
Serial No.,,,,,,,,,,,
1,1,337,118,4,4.5,4.5,9.65,1,0.92,True,True
2,2,316,104,3,3.0,3.5,8.00,1,0.72,True,True
3,3,322,110,3,3.5,2.5,8.67,1,0.80,True,True
4,4,314,103,2,2.0,3.0,8.21,0,0.65,True,True
5,5,330,115,5,4.5,3.0,9.34,1,0.90,True,True

Create a column called `decision2` in the `admissions` dataframe. Assign 1 to this column if the value of `SOP` is greater than 3 and 0 otherwise.    
HINT (use np.where)

In [78]:
admissions["Decision2"] = admissions["SOP"].apply(lambda i: 1 if i > 3 else 0)